# AssemblyViewUtils.CreateSingleCategorySchedule Method

---
| Name| Description
---|---|---
| CreateSingleCategorySchedule(Document, ElementId, ElementId)|  Creates a new single-category schedule assembly view for the assembly instance.
| CreateSingleCategorySchedule(Document, ElementId, ElementId, ElementId, Boolean)|  Creates a new single-category schedule assembly view for the assembly instance.
Top
#### Reference
AssemblyViewUtils Class
Autodesk.Revit.DB Namespace